{
  "xyz company": [
    "At XYZ, John migrated their main application product to the AWS cloud services",
    "At XYZ, John improved developer productivity by 500%",
    "At XYZ, John automated the application build process with Jenkins and Github Actions"
  ],
  "company abc": [
    "At ABC, John Maintained and added functionality to the web-based application, meow meow beans"
  ],
  "spring": [
    "John spent most of his time at Company ABC refactoring numerous Spring applications as part of the Oracle to postgres migration project",
    "At XYZ Company, John created a website for querying and visualizing political donations in Angular using GitHub Pages, Heroku, Spring Boot, and the open FEC Rest API."
  ],
  "c-sharp": [
    "John created an award winning application using c# and .net",
    "John used c# and Unity to develop multiple games you can download on the app store"
  ],
  "javascript": [
    "John has used a number of javascript frameworks including react and angular",
    "John has used vanilla javascript in millions of published webpages"
  ],
  "aws": [
    "John has extensive experience with AWS and other cloud products",
    "Here's another anecdote about John's experience with AWS",
    "John made AWS with his two bare hands"
  ],
  "cloud": ["John loves cloud development, he truely does"],
  "python": [
    "John created me! the John Doe Job Bot! using python!",
    "John wrote a couple python scripts in college",
    "John is a python wizard"
  ],
  "linux": [
    "John is a mint distro superuser",
    "John uses ssh to push code to linux servers",
    "John wrote shell scripts to launch apps on linux servers"
  ],
  "java": ["John has a bajillion years of professional java experience"],
  "selenium": [
    "This service, The John Doe Job Bot, utilizes selenium to answer google voice calls."
  ],
  "sql": [
    "John has lots of experience in sql",
    "John did this and that with sql",
    "John is the best at performance tuning sql queries"
  ],
  "sequel": [
    "John has lots of experience in sql",
    "John did this and that with sql",
    "John is the best at performance tuning sql queries"
  ],
  "agile": [
    "John has extensive experience in scrum and safe agile",
    "John loves agile more than he loves waterfall"
  ],
  "json": [
    "John edited this script in json",
    "John added keys for array strings as appropriate to match his work experience.",
    "keys for this script should be in all lower case."
  ]
}
